app/Models/BannerModel.php

SELECT *
FROM `banners`
---
    public function listar_banners()
    {
        return $this->findAll();